# GetRegisteredResults Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialFieldManager..::..GetRegisteredResults Method
SpatialFieldManager Class See Also
---
Returns an array of indices of all registered results
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<int> GetRegisteredResults()
```

Visual Basic
---
```text
Public Function GetRegisteredResults As IList(Of Integer)
```

Visual C++
---
```text
public:
IList<int>^ GetRegisteredResults()
```

# See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace